**Discente:** Paulo Guilherme Silva de Araújo 

**Turma:** Engenharia de Computação - 2° Período (B)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

**Exercício 1:**

In [2]:
d = {'Idade': [36, 51, 26, 25, 29, 53, 42, 38, 35, 45, 26, 37, 24, 31, 29], 
     'Salário': [6300, 5700, 4500, 3800, 3200, 7300, 7100, 5600, 6400, 7000,
                3700, 6500, 4000, 5100, 4500]}
df = pd.DataFrame(data=d)
df

    Idade  Salário
0      36     6300
1      51     5700
2      26     4500
3      25     3800
4      29     3200
5      53     7300
6      42     7100
7      38     5600
8      35     6400
9      45     7000
10     26     3700
11     37     6500
12     24     4000
13     31     5100
14     29     4500

In [64]:
dados = df['Idade']

In [65]:
fa,classes= np.histogram(dados, bins=[19, 24, 29, 34, 39, 44, 49])

In [66]:
fa = fa.astype(int)

In [67]:
fr = np.around(fa/fa.sum()*100,decimals=2)

In [68]:
fc = np.cumsum(fa).astype(int)

In [69]:
classe_str = []
for i in range(len(classes+1)):
    if i<=len(classes)-2:
        classe_str.append('{:2.2f} |-- {:2.2f}' .format(classes[i],classes[i+1]))
    else:
        break

In [70]:
pd.DataFrame({'Classes':classe_str, 
                         'fi': fa,
                         'fr': fr,
                         #'frnorm':frnorm,
                         'Fc': fc
                        }).set_index('Classes')

                 fi     fr  Fc
Classes
19.00 |-- 24.00   0   0.00   0
24.00 |-- 29.00   4  30.77   4
29.00 |-- 34.00   3  23.08   7
34.00 |-- 39.00   4  30.77  11
39.00 |-- 44.00   1   7.69  12
44.00 |-- 49.00   1   7.69  13

**Exercício 2:**

In [88]:
dados2 = df['Salário']

In [89]:
fa2,classes2= np.histogram(dados2, bins= 5)

In [90]:
fa2 = fa2.astype(int)

In [91]:
fr2 = np.around(fa2/fa2.sum()*100,decimals=2)

In [92]:
fc2 = np.cumsum(fa2).astype(int)

In [93]:
classe_str2 = []
for i in range(len(classes2)):
    if i<=len(classes2)-2:
        classe_str2.append('{:2.2f} |-- {:2.2f}' .format(classes2[i],classes2[i+1]))
    else:
        break

In [94]:
pd.DataFrame({'Classes':classe_str2, 
                         'fi': fa2,
                         'fr': fr2,
                         #'frnorm':frnorm,
                         'Fc': fc2
                        }).set_index('Classes')

                     fi     fr  Fc
Classes
3200.00 |-- 4020.00   4  26.67   4
4020.00 |-- 4840.00   2  13.33   6
4840.00 |-- 5660.00   2  13.33   8
5660.00 |-- 6480.00   3  20.00  11
6480.00 |-- 7300.00   4  26.67  15